#include "renderer.h"
#include "raylib.h"

// ------------------------------------------------------------
// Инициализация окна и рендера
// ------------------------------------------------------------
void Renderer_Init(int width, int height, const char *title) {
    InitWindow(width, height, title);
    SetTargetFPS(60);
}

// ------------------------------------------------------------
// Начало кадра
// ------------------------------------------------------------
void Renderer_Begin(void) {
    BeginDrawing();
    ClearBackground(BLUE);
}

// ------------------------------------------------------------
// Конец кадра
// ------------------------------------------------------------
void Renderer_End(void) {
    EndDrawing();
}

// ------------------------------------------------------------
// Завершение рендера
// ------------------------------------------------------------
void Renderer_Shutdown(void) {
    CloseWindow();
}
